"""
h = 9;     q = 4;

ДУ: dh/dt = 1 / S * (Q(t)-q(t));
ПФОС: W(s) = k = 1;
1. Построить систему управления с использованием ПИ и ПИД регулятора, который бы обеспечивал e[уст]→0. Получить для с
системы с каждым видом регулятора переходную характеристику и частотные характеристики.
Сравнить полученные результаты и сделать выводы.
2. Определить параметры ПИД-регулятора при наименьшем перерегулировании в системе. При полученных параметрах
 определить запасы устойчивости по амплитуде и фазе, степень устойчивости и колебательности. Сделать выводы.
3. Определить параметры ПИД-регулятора при наименьшем времени регулирования в системе. При полученных
 параметрах определить запасы устойчивости по амплитуде и фазе, степень устойчивости и колебательности.
 Сделать выводы.

"""
