"""
T = 0.6

Для системы автоматического регулирования, структурная схема которой приведена на task3_schema,
принять ПФ: <task3_formulas>.

1. Определить аналитическую зависимость ИКО  от коэффициента передачи k. Вычисления производятся
в соответствии с формулами (1.4) - (1.6) [метод.]. Построить график зависимости ИКО I_0 от коэффициента
передачи K_r.
2. Получить семейство зависимостей улучшенной ИКО  от коэффициента  при нескольких значениях весового
коэффициента . Полученные результаты представить в соответствующих строках табл. 1. Вычисления производятся
в соответствии с формулами, приведенными в основных сведениях из теории настоящих указаний.

    Ответить на следующие вопросы:
3.1 Какова качественная связь ИКО  с характером переходного процесса при воздействии g(t)=g_01(t) ?
3.2 Какую форму кривой переходного процесса в исследуемой системе обеспечивает минимум улучшенной ИКО?


"""
